import numpy as np

###################### 배관 두께측정 참값 데이터 생성 ###########################

###############################################################################
## Hypothetical Thinned Pipe Shape     ########################################
##     행 = 원주 N_c개,  열 = 축 N_a개  ########################################
###############################################################################

###############################################################################
#깊이방향 원/타원 - eliptical depth profile
def F_Thin_Pipe_eliptical(N_a, N_c, depth_r, area_r, aspect_r, cen_a, cen_c): 
    """
    *INPUT,  N_a        : scalar 정수, 축방향 그리드 개수
             N_c        : scalar 정수, 원주방향 그리드 개수
             depth_r    : scalar 실수(0~1), 감육깊이비 (감육깊이/공칭두께)
             area_r     : scalar 실수(0~1), 감육면적비 (감육면적/전체면적, 펼친 직사각형 기준)
             aspect_r   : scalar 실수(양수), 감육면적 형상비 (감육길이(축)/감육폭(원주))
             cen_a      : scalar 실수(0~1), 감육중심위치 (축)
             cen_c      : scalar 실수(0~1), 감육중심위치 (원주)

    *OUTPUT, t_thin[N_c, N_a]   : np.array, 감육 위치별 값 (행:circum, 열:axial)   
    """
    #--------------------------------------------------------------------------
    # 주요배열변수 정의
    t_thin = np.zeros([N_c, N_a])   #감육비(감육량/공칭두께) 분포
    a = np.linspace(0.,1.,N_a)      #그리드좌표-a
    c = np.linspace(0.,1.,N_c)      #그리드좌표-c
    #--------------------------------------------------------------------------
    
    #--------------------------------------------------------------------------
    # 감육깊이 계산을 위한 계수 계산
    w_r = (area_r / aspect_r / np.pi)**0.5
    l_r = w_r * aspect_r
    if depth_r == 0. :
        R1 = 0.
        R2 = 0.
    else :
        R1 = (w_r**2 + depth_r**2) / (2.*depth_r)
        R2 = (l_r**2 + depth_r**2) / (2.*depth_r)
    #--------------------------------------------------------------------------

    #--------------------------------------------------------------------------
    # 감육깊이 계산
    for i in range(0, N_a) :
        for j in range(0, N_c) :
            aa = a[i] - cen_a
            cc = c[j] - cen_c
            # 원주방향 거울 중심축 고려하기-------------------------------------
            cen_mirror = cen_c + (N_c/(N_c-1.)/2.) # 거울중심축 계산
            if cen_mirror < 1. :
                # 거울중심축 < 1
                if c[j] <= cen_mirror :
                    cc = c[j] - cen_c
                else :
                    cc = (cen_mirror *2. - c[j]) - cen_c
            else :
                # 거울중심축 ? 1
                cen_mirror = cen_mirror - 1. - c[1]
                if c[j] >= cen_mirror :
                    cc = c[j] - cen_c
                else :
                    cc = ((cen_mirror) *2. - c[j]) - cen_c            
            #------------------------------------------------------------------
            if cc > R1 or cc < -R1 or aa > R2 or aa < -R2 :
                t_thin[j,i] = 0.
            else :
                if depth_r == 0. :
                    t_thin[j,i] = 0.
                else :
                    t_thin[j,i] = depth_r - R1 + (R1**2 - cc**2)**0.5 - R2 + (R2**2 - aa**2)**0.5
                if t_thin[j,i] < 0. :
                    t_thin[j,i] = 0.
    #--------------------------------------------------------------------------
    return t_thin #감육비(감육량/공칭두께) 분포(배열) 출력

###############################################################################



# 원주방향 배관 두께 데이터 초기 및 마지막 값 생산 함수
def make_true(N_a, N_c, N_tn, delta_t, t_i_1, t_i_2, t_i_3):
    # y1 초기 데이터 생산
    y1 = np.linspace(0,2*np.pi,N_c)
    y1 = np.cos(y1)
    y1 = 0.1*y1 + 1   # 0.9 ~ 1.1 코사인함수 배관 원주방향 데이터 생성(중간값이 외호기준)    
    y1 = np.tile(y1.reshape(-1,1),N_a)
    y1 = np.tile(y1, (N_tn,1,1))
    
    # y3 감육진행 데이터 생산
    y3 = y1 - delta_t
    
    y2 = y1 - (t_i_2-t_i_1)/(t_i_3-t_i_1) * delta_t
        
    return y1, y2, y3


